Repository: mclellac/AkamaiStaging
Catalog: po/*.po
Languages: fr

# shortcut window
source: General
fr: Général

# shortcut window
source: Show Shortcuts
fr: Afficher les raccourcis

# shortcut window
source: Quit
fr: Quitter

source: Akamai Staging Network Spoof
fr: Mystification du réseau de transit Akamai

source: Enter domain or URL to add to Akamai Staging.
fr: Entrez le domaine ou l'URL à ajouter à Akamai Staging.

source: Get Akamai Staging Network IP
fr: Obtenir l'IP du réseau de transit Akamai

source: Domain/URL
fr: Domaine/URL

source: Add
fr: Ajouter

source: Search hosts...
fr: Rechercher des hôtes...

source: These are the custom host entries currently managed by this tool. Select an entry to manage it.
fr: Voici les entrées d'hôtes personnalisées actuellement gérées par cet outil. Sélectionnez une entrée pour la gérer.

source: Hosts File Entries
fr: Entrées du fichier hosts

source: No Host Entries
fr: Aucune entrée d'hôte

source: Add a domain using the input field above to get started, or try adjusting your search filter.
fr: Ajoutez un domaine en utilisant le champ de saisie ci-dessus pour commencer, ou essayez d'ajuster votre filtre de recherche.

source: Status
fr: Statut

source: Manage Selected Host
fr: Gérer l'hôte sélectionné

# button
source: Delete Selected Host
fr: Supprimer l'hôte sélectionné

source: Select the line from /etc/hosts you want to remove and click this button to delete it.
fr: Sélectionnez la ligne du fichier /etc/hosts que vous souhaitez supprimer et cliquez sur ce bouton pour la supprimer.

source: Edit Selected Host
fr: Modifier l'hôte sélectionné

source: Select the line from /etc/hosts you want to edit and click this button.
fr: Sélectionnez la ligne du fichier /etc/hosts que vous souhaitez modifier et cliquez sur ce bouton.

source: _Preferences
fr: _Préférences

source: _Keyboard Shortcuts
fr: _Raccourcis clavier

source: _About AkamaiStaging
fr: _À propos d'AkamaiStaging

source: Light
fr: Clair

source: Dark
fr: Sombre

source: System
fr: Système

source: System Default
fr: Défaut du système

source: Appearance
fr: Apparence

source: Theme
fr: Thème

source: Choose the application color scheme
fr: Choisissez la palette de couleurs de l'application

source: Font Scale
fr: Échelle de la police

source: Adjust application font size
fr: Ajuster la taille de la police de l'application

source: Network
fr: Réseau

source: Use Custom DNS Servers
fr: Utiliser des serveurs DNS personnalisés

source: Override system DNS settings for lookups
fr: Remplacer les paramètres DNS du système pour les recherches

source: DNS Servers
fr: Serveurs DNS

source: IP Address
fr: Adresse IP

source: Hostname
fr: Nom d'hôte

source: Error loading hosts entries: {error_detail}
fr: Erreur lors du chargement des entrées d'hôtes : {error_detail}

source: Notice: Input '{domain_input}' sanitized to '{sanitized_domain}'.
fr: Avis : L'entrée '{domain_input}' a été normalisée en '{sanitized_domain}'.

source: Invalid domain format. Please enter a valid domain (e.g., www.example.com).
fr: Format de domaine invalide. Veuillez entrer un domaine valide (par exemple, www.example.com).

source: Could not determine Akamai staging IP for {domain}.
fr: Impossible de déterminer l'IP de transit Akamai pour {domain}.

source: DNS lookup failed for {domain}: {error}
fr: La recherche DNS a échoué pour {domain} : {error}

source: Host '{domain}' added.
fr: Hôte '{domain}' ajouté.

source: Host '{domain}' already configured.
fr: L'hôte '{domain}' est déjà configuré.

source: Operation cancelled by user.
fr: Opération annulée par l'utilisateur.

source: Permission error occurred.
fr: Une erreur de permission s'est produite.

source: File I/O error occurred.
fr: Une erreur d'E/S de fichier s'est produite.

source: Hosts file not found.
fr: Fichier hosts introuvable.

source: Feature unavailable in Flatpak.
fr: Fonctionnalité non disponible dans Flatpak.

source: Failed to add host '{domain}'.
fr: Échec de l'ajout de l'hôte '{domain}'.

source: Invalid domain format entered.
fr: Format de domaine invalide saisi.

source: Found staging IP {ip} for Akamai Staging domain {staging_cname} (derived from {original_domain}). Attempting to add to hosts file...
fr: IP de transit {ip} trouvée pour le domaine Akamai Staging {staging_cname} (dérivé de {original_domain}). Tentative d'ajout au fichier hosts...

source: Found staging IP {ip} for {original_domain}. Attempting to add to hosts file...
fr: IP de transit {ip} trouvée pour {original_domain}. Tentative d'ajout au fichier hosts...

source: Failed to process staging request for {domain}: {error}
fr: Échec du traitement de la demande de transit pour {domain} : {error}

source: Failed to process staging request.
fr: Échec du traitement de la demande de transit.

source: No entry selected for deletion.
fr: Aucune entrée sélectionnée pour la suppression.

source: Confirm Deletion
fr: Confirmer la suppression

source: Are you sure you want to delete the selected entry: '{entry}'?
fr: Êtes-vous sûr de vouloir supprimer l'entrée sélectionnée : '{entry}' ?

source: Cancel
fr: Annuler

source: Delete
fr: Supprimer

source: Error: No item was identified for deletion.
fr: Erreur : Aucun élément n'a été identifié pour la suppression.

source: Error: No item identified for deletion.
fr: Erreur : Aucun élément identifié pour la suppression.

source: Deletion cancelled.
fr: Suppression annulée.

source: Host '{entry}' removed.
fr: Hôte '{entry}' supprimé.

source: Host '{entry}' not found.
fr: Hôte '{entry}' introuvable.

source: Permission error during removal.
fr: Erreur de permission lors de la suppression.

source: File I/O error during removal.
fr: Erreur d'E/S de fichier lors de la suppression.

source: Failed to remove '{entry}'.
fr: Échec de la suppression de '{entry}'.

source: Removal of old entry '{entry}' cancelled by user.
fr: Suppression de l'ancienne entrée '{entry}' annulée par l'utilisateur.

source: Permission error removing old entry '{entry}'.
fr: Erreur de permission lors de la suppression de l'ancienne entrée '{entry}'.

source: I/O error removing old entry '{entry}'.
fr: Erreur d'E/S lors de la suppression de l'ancienne entrée '{entry}'.

source: Feature unavailable in Flatpak. Cannot remove old entry '{entry}'.
fr: Fonctionnalité non disponible dans Flatpak. Impossible de supprimer l'ancienne entrée '{entry}'.

source: Failed to remove old entry '{entry}'. Edit aborted.
fr: Échec de la suppression de l'ancienne entrée '{entry}'. Modification annulée.

source: Host entry updated to '{ip} {hostname}'.
fr: Entrée d'hôte mise à jour vers '{ip} {hostname}'.

source: Host entry '{ip} {hostname}' already configured.
fr: L'entrée d'hôte '{ip} {hostname}' est déjà configurée.

source: Save operation cancelled by user.
fr: Opération de sauvegarde annulée par l'utilisateur.

source: Permission error saving changes.
fr: Erreur de permission lors de la sauvegarde des modifications.

source: I/O error saving changes.
fr: Erreur d'E/S lors de la sauvegarde des modifications.

source: Failed to save changes for '{hostname}'.
fr: Échec de la sauvegarde des modifications pour '{hostname}'.

source: No entry selected to edit.
fr: Aucune entrée sélectionnée pour modification.

source: Edit Host Entry
fr: Modifier l'entrée d'hôte

source: Modify the IP address and/or hostname.
fr: Modifiez l'adresse IP et/ou le nom d'hôte.

source: Save Changes
fr: Enregistrer les modifications

source: Attempting to change '{old_ip} {old_hostname}' to '{new_ip} {new_hostname}'...
fr: Tentative de modification de '{old_ip} {old_hostname}' en '{new_ip} {new_hostname}'...

source: Removing old entry: {entry}...
fr: Suppression de l'ancienne entrée : {entry}...

source: Failed to remove old entry '{entry}'. Edit operation aborted.
fr: Échec de la suppression de l'ancienne entrée '{entry}'. Opération de modification annulée.

source: Adding new/updated entry: {ip} {hostname}...
fr: Ajout d'une nouvelle entrée/mise à jour : {ip} {hostname}...

source: Error: IP address and hostname cannot be empty.
fr: Erreur : L'adresse IP et le nom d'hôte ne peuvent pas être vides.

source: IP and hostname cannot be empty.
fr: L'IP et le nom d'hôte ne peuvent pas être vides.

source: No changes detected.
fr: Aucune modification détectée.

source: Edit operation cancelled by user.
fr: Opération de modification annulée par l'utilisateur.

source: Edit operation cancelled.
fr: Opération de modification annulée.

source: Akamai Staging is an application designed to manage and apply Akamai Staging IPs for testing configurations on Akamaized domains.
fr: Akamai Staging est une application conçue pour gérer et appliquer les IP de transit Akamai pour tester les configurations sur les domaines Akamaized.

source: No description
fr: Aucune description
